Show / Hide Table of Contents
Class NullLogger
Logger that does nothing.
Inheritance
System.Object
NullLogger
Implements
IPluginLogger
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class NullLogger : IPluginLogger
Methods
Improve this Doc   View Source
LogDebug(String, Exception)
Declaration
public void LogDebug(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
 System.Exception |  ex
Improve this Doc   View Source
LogError(String, Exception)
Declaration
public void LogError(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
 System.Exception |  ex
Improve this Doc   View Source
LogInformation(String, Exception)
Declaration
public void LogInformation(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
 System.Exception |  ex
Improve this Doc   View Source
LogTrace(String, Exception)
Declaration
public void LogTrace(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
 System.Exception |  ex
Improve this Doc   View Source
LogWarning(String, Exception)
Declaration
public void LogWarning(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
 System.Exception |  ex
Implements
 IPluginLogger
 Improve this Doc
 View Source